In [1]:
import pandas as pd
from sqlalchemy import create_engine,text
import logging

# Setup logging
logging.basicConfig(level=logging.INFO, format='%(asctime)s - %(levelname)s - %(message)s')

# DB connection
src_db = 'postgresql://postgres:postgres@pgdb:5432/Adventureworks'
trg_db = 'postgresql://postgres:postgres@pgdb:5432/AdventureworksDW'

src_engine = create_engine(src_db)
trg_engine = create_engine(trg_db)

def extract(query, engine):
    """Extract data from the source database."""
    try:
        df = pd.read_sql_query(query, con=engine)
        logging.info(f"Data extracted successfully for query: {query}")
        return df
    except Exception as e:
        logging.error(f"Error extracting data: {e}")
        raise

def load(df, table_name, engine):
    """Load data into the target database."""
    try:
        df.to_sql(table_name, con=engine, if_exists='replace', index=False)
        logging.info(f"Data loaded into {table_name}")
    except Exception as e:
        logging.error(f"Error loading data into {table_name}: {e}")
        raise

# Transform to DimCurrency
def populate_dim_currency(currency_df):
    dim_currency_df = currency_df[['currencycode', 'name']].drop_duplicates()
    
    # Sort dataframe by 'name' (currencyname) alphabetically
    dim_currency_df = dim_currency_df.sort_values(by='name')
    
    # Reset index => create sequential 'currencykey'
    dim_currency_df.reset_index(drop=True, inplace=True)
    
    # Add'currencykey' col (1 to no. of rows)
    dim_currency_df['currencykey'] = dim_currency_df.index + 1
    
    # Rename col to match DimCurrency
    dim_currency_df.rename(columns={'currencycode': 'currencyalternatekey', 'name': 'currencyname'}, inplace=True)
    
    # Reorder col to match desired output
    dim_currency_df = dim_currency_df[['currencykey', 'currencyalternatekey', 'currencyname']]
    
    return dim_currency_df


# Tranform to FactCurrencyRate
def populate_fact_currency_rate(currency_rate_df, dim_currency_df):
    # Map 'tocurrencycode' to 'currencykey'
    fact_currency_rate_df = currency_rate_df.merge(
        dim_currency_df,
        left_on='tocurrencycode',
        right_on='currencyalternatekey',
        how='left'
    )
    
    # Only include rows where it's in dim_currency_df ('currencykey' can't be NaN)
    fact_currency_rate_df = fact_currency_rate_df[fact_currency_rate_df['currencykey'].notna()]
    
    # Convert 'currencyratedate' to 'datekey' in YYYYMMDD format
    fact_currency_rate_df['datekey'] = pd.to_datetime(fact_currency_rate_df['currencyratedate']).dt.strftime('%Y%m%d').astype(int)
    
    # Rename col to match FactCurrencyRate
    fact_currency_rate_df.rename(columns={'currencyratedate': 'date'}, inplace=True)
    
    # Reorder col to match FactCurrencyRate
    fact_currency_rate_df = fact_currency_rate_df[['currencykey', 'datekey', 'averagerate', 'endofdayrate', 'date']]
    
    return fact_currency_rate_df


# Transform to DimDepartmentGroup
def transform_dim_department_group(department_df):
    # Copy relevant column and rename to match DimDepartmentGroup
    dim_department_group_df = department_df[['groupname']].copy()

    # Remove any duplicate 'groupname'
    dim_department_group_df = dim_department_group_df.drop_duplicates(subset='groupname')
    
    # Sort dataframe by 'groupname' alphabetically
    dim_department_group_df.sort_values(by='groupname', inplace=True)
    
    # Reset index => create sequential 'departmentgroupkey' (1 to no. rows)
    dim_department_group_df.reset_index(drop=True, inplace=True)
    dim_department_group_df['departmentgroupkey'] = dim_department_group_df.index + 1
    
    # Assume no hierarchical data available, so parentdepartmentgroupkey to None (NULL)
    dim_department_group_df['parentdepartmentgroupkey'] = None

    # Rename col to match DimDepartmentGroup
    dim_department_group_df.rename(columns={'groupname': 'departmentgroupname'}, inplace=True)
    
    # Reorder col to match DimDepartmentGroup
    dim_department_group_df = dim_department_group_df[['departmentgroupkey', 'parentdepartmentgroupkey', 'departmentgroupname']]
    
    return dim_department_group_df

In [2]:
# Extract source data
df_country_region_currency = extract('SELECT * FROM sales.countryregioncurrency', src_engine)
df_currency = extract('SELECT * FROM sales.currency', src_engine)
df_currency_rate = extract('SELECT * FROM sales.currencyrate', src_engine)
df_department = extract('SELECT * FROM humanresources.department', src_engine)

2024-03-19 11:19:02,890 - INFO - Data extracted successfully for query: SELECT * FROM sales.countryregioncurrency
2024-03-19 11:19:02,895 - INFO - Data extracted successfully for query: SELECT * FROM sales.currency
2024-03-19 11:19:03,055 - INFO - Data extracted successfully for query: SELECT * FROM sales.currencyrate
2024-03-19 11:19:03,059 - INFO - Data extracted successfully for query: SELECT * FROM humanresources.department

In [3]:
df_dim_currency = populate_dim_currency(df_currency)

In [4]:
df_currency_rate.head()

,currencyrateid,currencyratedate,fromcurrencycode,tocurrencycode,averagerate,endofdayrate,modifieddate
0,1,2011-05-31,USD,ARS,1.0000,1.0002,2011-05-31
1,2,2011-05-31,USD,AUD,1.5491,1.5500,2011-05-31
2,3,2011-05-31,USD,BRL,1.9379,1.9419,2011-05-31
3,4,2011-05-31,USD,CAD,1.4641,1.4683,2011-05-31
4,5,2011-05-31,USD,CNY,8.2781,8.2784,2011-05-31

In [5]:
df_dim_currency

     currencykey currencyalternatekey     currencyname
0              1                  AFA          Afghani
1              2                  DZD   Algerian Dinar
2              3                  ARS   Argentine Peso
3              4                  AMD    Armenian Dram
4              5                  AWG   Aruban Guilder
..           ...                  ...              ...
100          101                  KRW              Won
101          102                  JPY              Yen
102          103                  CNY    Yuan Renminbi
103          104                  ZWD  Zimbabwe Dollar
104          105                  PLN            Zloty

[105 rows x 3 columns]

In [6]:
load(df_dim_currency, 'DimCurrency', trg_engine)

2024-03-19 11:19:30,384 - INFO - Data loaded into DimCurrency

In [7]:
# Transform and load data for FactCurrencyRate
# !! Missing multiple rows compared to FactCurrencyRate in AdventureworksDW cause it is not in the src data !! 
df_fact_currency_rate = populate_fact_currency_rate(df_currency_rate, df_dim_currency)
df_fact_currency_rate.head()

   currencykey   datekey  averagerate  endofdayrate       date
0            3  20110531       1.0000        1.0002 2011-05-31
1            6  20110531       1.5491        1.5500 2011-05-31
2           16  20110531       1.9379        1.9419 2011-05-31
3           20  20110531       1.4641        1.4683 2011-05-31
4          103  20110531       8.2781        8.2784 2011-05-31

In [8]:
load(df_fact_currency_rate, 'FactCurrencyRate', trg_engine)

2024-03-19 11:19:49,905 - INFO - Data loaded into FactCurrencyRate

In [9]:
# Transform and load data for DimDepartmentGroup
df_dim_department_group = transform_dim_department_group(df_department)

In [10]:
df_dim_department_group

,departmentgroupkey,parentdepartmentgroupkey,departmentgroupname
0,1,None,Executive General and Administration
1,2,None,Inventory Management
2,3,None,Manufacturing
3,4,None,Quality Assurance
4,5,None,Research and Development
5,6,None,Sales and Marketing

In [11]:
query = text("SELECT * FROM DimDepartmentGroup")

with trg_engine.connect() as connection:
    result = connection.execute(query)
    df = pd.DataFrame(result.fetchall(), columns=result.keys())

In [12]:
df

,departmentgroupkey,parentdepartmentgroupkey,departmentgroupname
0,1,NaN,Corporate
1,2,1.0,Executive General and Administration
2,3,1.0,Inventory Management
3,4,1.0,Manufacturing
4,5,1.0,Quality Assurance
5,6,1.0,Research and Development
6,7,1.0,Sales and Marketing

In [13]:
load(df_dim_department_group, 'DimDepartmentGroup', trg_engine)

2024-03-19 11:20:46,759 - INFO - Data loaded into DimDepartmentGroup